In [2]:
import pandas as pd
import numpy as np

In [4]:
sozlukVerisi = {"İstanbul": [30,29,np.nan],"Ankara":[20,np.nan,25],"İzmir":[40,38,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [5]:
havaDurumuDataFrame

   İstanbul  Ankara  İzmir
0      30.0    20.0     40
1      29.0     NaN     38
2       NaN    25.0     38

In [6]:
havaDurumuDataFrame.dropna()

   İstanbul  Ankara  İzmir
0      30.0    20.0     40

In [7]:
havaDurumuDataFrame

   İstanbul  Ankara  İzmir
0      30.0    20.0     40
1      29.0     NaN     38
2       NaN    25.0     38

In [8]:
havaDurumuDataFrame.dropna(axis=1)

   İzmir
0     40
1     38
2     38

In [9]:
yeniVeri = {"İstanbul": [30,29,np.nan],"Ankara":[20,np.nan,25],"İzmir":[40,38,38],"Antalya":[45,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)

In [10]:
yeniDataFrame

   İstanbul  Ankara  İzmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     38      NaN
2       NaN    25.0     38      NaN

In [11]:
yeniDataFrame.dropna(axis=1,thresh=2)

   İstanbul  Ankara  İzmir
0      30.0    20.0     40
1      29.0     NaN     38
2       NaN    25.0     38

In [13]:
yeniDataFrame.fillna(20)

   İstanbul  Ankara  İzmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     38     20.0
2      20.0    25.0     38     20.0

# groupby

In [21]:
maasSozlugu = {"Departman":["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
              "Çalışan İsmi":["Ahmet","Mehmet","Burak","Tacer","Zeynep","Fatma"],
              "Maaş":[100,200,300,400,500,600]}

In [22]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [23]:
maasDataFrame

   Departman Çalışan İsmi  Maaş
0    Yazılım        Ahmet   100
1    Yazılım       Mehmet   200
2  Pazarlama        Burak   300
3  Pazarlama        Tacer   400
4      Hukuk       Zeynep   500
5      Hukuk        Fatma   600

In [25]:
grupobjesi = maasDataFrame.groupby("Departman")

In [28]:
grupobjesi.count()

           Çalışan İsmi  Maaş
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [29]:
grupobjesi.mean()

            Maaş
Departman
Hukuk      550.0
Pazarlama  350.0
Yazılım    150.0

In [30]:
grupobjesi.max()

          Çalışan İsmi  Maaş
Departman
Hukuk           Zeynep   600
Pazarlama        Tacer   400
Yazılım         Mehmet   200

In [31]:
grupobjesi.describe()

           Maaş
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  550.0  70.710678  500.0  525.0  550.0  575.0  600.0
Pazarlama   2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0
Yazılım     2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0